bases/SBB_Broker/projects/ACCOUNTING-18422 Форма 0420454 НКЛ/Исходники/Reports/РасчетПоказателяКраткосрочнойЛиквидности_7_1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РасчетПоказателяКраткосрочнойЛиквидности_7_1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Развернутый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.XBRLТочкиВхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранитьСписок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумагиДляРеестраЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

bases/SBB_Broker/projects/ACCOUNTING-18422 Форма 0420454 НКЛ/Исходники/Reports/РасчетПоказателяКраткосрочнойЛиквидности_7_1/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Отчет", преобразованный в объект прикладного типа

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
	Отчет.Дата = ТекущаяДатаСеанса();
	
	Отчет.Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	
	Отчет.СохранитьСписок = Истина;
	ВидОтчета =
		Справочники.XBRLВидыОтчетов.ПолучитьСоздатьПоКоду("0420454_7.1", "0420454_7.1 Расчет норматива краткосрочной ликвидности брокера");
	ТочкиВхода = Справочники.XBRLТочкиВхода.ТочкиВходаПоВидуОтчета(ВидОтчета);
	Если ЗначениеЗаполнено(ТочкиВхода) Тогда
		Элементы.ТочкаВхода.СписокВыбора.ЗагрузитьЗначения(ТочкиВхода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВосстановитьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для выгрузки файлов";
	
	Если Диалог.Выбрать() Тогда
		Отчет.КаталогФайла = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.Организация) Тогда
		ТекстОшибки = "Не заполнена организация отчета";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.Дата) Тогда
		ТекстОшибки = "Не заполнена дата отчета";
	КонецЕсли;
	
	Если ТекстОшибки <> Неопределено Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Если ТекущийОбъект().СохранитьСписок И Не ЗначениеЗаполнено(ТекущийОбъект().ТочкаВхода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана точка входа!", , , "Отчет.ТочкаВхода");
		Возврат;
	КонецЕсли;
	
	Если Не ТекущийОбъект().СохранитьСписок И ЗначениеЗаполнено(ТекущийОбъект().ТочкаВхода) Тогда
		ТекстСообщения = "Не указан флаг 'Сохранить список ЦБ для формирования реестра ЦБ (ф. 459)'!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , "Отчет.СохранитьСписок");
		Возврат;
	КонецЕсли;
	
	ВремяНачалаФормированияОтчета = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТабличныеДокументы = ТекущийОбъект().ТабличныеДокументы();
	
	ТекстОшибки = ТабличныеДокументы.Получить("ТекстОшибки");
	Если Не ТекстОшибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	ОтображаемыеПункты = Новый Массив;
	
	Для Каждого ТабличныйДокумент Из ТабличныеДокументы Цикл
		
		Если ТабличныйДокумент.Ключ = "ТекстОшибки" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЗакладки = "Строка" + ТабличныйДокумент.Ключ;
		ИмяТабДок = "Результат" + ТабличныйДокумент.Ключ;
		
		ОтображаемыеПункты.Добавить(ИмяЗакладки);
		
		ПунктРасшифровки = Элементы.Найти(ИмяЗакладки);
		
		Если ПунктРасшифровки = Неопределено Тогда
			
			Страница = Элементы.Вставить(ИмяЗакладки, Тип("ГруппаФормы"), Элементы.ГруппаРезультаты);
			Страница.Заголовок = СтрЗаменить(ИмяЗакладки, "П", " ");
			
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТабДок, Новый ОписаниеТипов("ТабличныйДокумент")));
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			Поле = Элементы.Вставить(ИмяТабДок, Тип("ПолеФормы"), Элементы[ИмяЗакладки]);
			Поле.ПутьКДанным = ИмяТабДок;
			Поле.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
			Поле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
		КонецЕсли;
		
		ЭтотОбъект[ИмяТабДок].Очистить();
		ЭтотОбъект[ИмяТабДок] = ТабличныйДокумент.Значение;
		
	КонецЦикла;
	
	ОтобразитьНаСервере(ОтображаемыеПункты);
	
	Если ТекущийОбъект().СохранитьСписок Тогда
		ТекущийОбъект().СохранитьСписокЦБДляФормированияРеестраЦБ();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РасчетПоказателяКраткосрочнойЛиквидности_7_1", ВремяНачалаФормированияОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьНаСервере(ОтображаемыеПункты)
	
	ИмяПрефиксаСтроки = "СтрокаП";
	
	Для Номер = 1 По 49 Цикл
		
		ИмяЗакладки = ИмяПрефиксаСтроки + Номер;
		
		ПунктРасшифровки = Элементы.Найти(ИмяЗакладки);
		
		Если ПунктРасшифровки <> Неопределено Тогда
			
			Элементы.Переместить(ПунктРасшифровки, ПунктРасшифровки.Родитель);
			
			ОтображаемыПункт = ОтображаемыеПункты.Найти(ИмяЗакладки);
			
			Если ОтображаемыПункт = Неопределено Тогда
				ПунктРасшифровки.Видимость = Ложь;
			Иначе
				ПунктРасшифровки.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗакладкиНомераКолонок = Новый Соответствие;
	ЗакладкиНомераКолонок.Вставить(37, 22);
	ЗакладкиНомераКолонок.Вставить(41, 27);
	ЗакладкиНомераКолонок.Вставить(43, 29);
	ЗакладкиНомераКолонок.Вставить(44, 31);
	Для Каждого СтрокаЗакладки Из ЗакладкиНомераКолонок Цикл
		ИмяЗакладки1 = ИмяПрефиксаСтроки + СтрокаЗакладки.Ключ;
		ПунктРасшифровки1 = Элементы.Найти(ИмяЗакладки1);
		ИмяЗакладки2 = ИмяПрефиксаСтроки + СтрокаЗакладки.Значение;
		ПунктРасшифровки2 = Элементы.Найти(ИмяЗакладки2);
		Если ПунктРасшифровки1 <> Неопределено И ПунктРасшифровки2 <> Неопределено Тогда
			Элементы.Переместить(ПунктРасшифровки1, ПунктРасшифровки1.Родитель, ПунктРасшифровки2);
			Элементы.Переместить(ПунктРасшифровки2, ПунктРасшифровки1.Родитель, ПунктРасшифровки1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.КаталогФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан путь к файлу!");
		Возврат;
	КонецЕсли;
	
	СохранитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ВремяНачалаСохраненияОтчета = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТабличныеДокументы = Новый Соответствие;
	
	ТабличныеДокументы.Вставить("Сводно", ЭтотОбъект["РезультатСводно"]);
	Для Сч = 1 По 4 Цикл
		ТабличныеДокументы.Вставить("Раздел" + Сч, ЭтотОбъект["РезультатРаздел" + Сч]);
	КонецЦикла;
	
	Для Номер = 1 По 49 Цикл
		Строка = Элементы.Найти("СтрокаП" + Номер);
		Если Строка <> Неопределено Тогда 
			ТабличныеДокументы.Вставить("Строка" + Номер, ЭтотОбъект["РезультатП" + Номер]);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеФайлов = ТекущийОбъект().ДанныеФайловExcel(ТабличныеДокументы);
	
	ТекстСообщений = "Файлы успешно сохранены:" + Символы.ПС;
	Для Каждого ДанныеФайла Из ДанныеФайлов Цикл
		ТекстСообщений = ТекстСообщений + ДанныеФайла.Значение + Символы.ПС;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщений);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РасчетПоказателяКраткосрочнойЛиквидности_7_1_Сохранение", ВремяНачалаСохраненияОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Функция ИмяОтчета()
	
	Возврат "Отчет." + ТекущийОбъект().Метаданные().Имя;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().СохранитьНастройки(ИмяОтчета, "РеквизитыШапки49");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ВосстановитьНастройки(ИмяОтчета, "РеквизитыШапки49");
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

#КонецОбласти
